Revit 2024 API
RebarConstraintType Enumeration
 The various types of constraints that can be applied to a RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum RebarConstraintType
Visual Basic
Public Enumeration RebarConstraintType
Visual C++
public enum class RebarConstraintType
Members
Member name | Description
FixedDistanceToHostFace |  Handle is constrained to remain a fixed distance from a host Element surface.
ToCover |  Handle is attached to the cover of a host Element surface.
ToOtherRebar |  Handle is attached to a handle on another Rebar Element. Only applies to Standard style bars, which can be constrained to Stirrup style bars.
See Also
Autodesk.Revit.DB.Structure Namespace